[
  "**Flux rules**\nEach player has their own turn, during which they will play cards from their hand. There are 4 different type of cards: rule, keeper, goal and action cards.\n**Rule cards** change the way a turn is played. Each rule card changes one rule, for example how many cards are drawn at the start of the turn, how many cards are played in a turn or how many cards can remain in one's hand after their turn.\n**Keeper cards** are always played to the front of the player. Keepers themselves don't do anything, but you can win the game by having the right keepers in front of you.\n**Goal cards** define the way the game is won. The most common type of goal is to have two specific keepers in front of you. If a player meets the current goal at any point of the game, they will immediately win the game.\n**Action cards** can do a large variety of things. You may for example discard a rule, switch a keeper with someone or have another turn.",
  "There are 7 different rules, all of which can be changed by playing rule cards.\n- **Play count** tells how many cards can be played in one turn.\n- **Draw count** tells how many cards will be drawn at the start of each turn. If the draw count is increased during your turn, you may draw new cards until you reach the draw count.\n- **Hand limit** sets the maximum number of cards allowed in a player's hand at the end of their turn. If a player has more cards than the hand limit at the end of their turn, they must discard cards until they meet the limit. When a new hand limit is set, all the players except the player whose turn it is must immediately discard cards until they meet the hand limit but for the player whose turn it is, the rule only applies at the end of the turn. This means that if the current player first sets the hand limit to 0 and then to 5 with another card, all the other players must discard all of their cards, while the current player may leave 5 cards in hand.",
  "- **Keeper limit** sets the maximum number of keepers allowed in front of a player at the end of their turn. If a player has more keepers than the keeper limit at the end of their turn, they must discard keepers until they meet the limit. When a new keeper limit is set, all the players except the player whose turn it is must immediately discard keepers until they meet the keeper limit but for the player whose turn it is, the rule only applies at the end of the turn. This means that if the current player first sets the keeper limit to 2 and then to 5 with another card, all the other players must discard all but 2 keepers while the current player may have 5.\n- **Secret keepers** is a rule affecting whether the players' keepers are shown to others or not. There are 3 possible states for this rule: Either no keepers are hidden, one keeper from each player is hidden or all keepers are hidden. When the keepers are hidden, other players may only see the amount of keepers in front of other players.",
  "- **Final card random**: makes it that the last card a player plays in their turn is chosen randomly. This rule is not applied if the play count rule is 1.\n- **Bonus** gives one player a small bonus by having the bonus' keeper in front of them. For example the money bonus allows the player who has money in front of them to have one keeper more than the keeper limit. The bonus is not applied if the keeper is hidden.",
  "keepers & goals",
  "actions",
  "The game goes on until one player meets the goal and wins. Played and discarded cards are put to the discard pile which is shuffled into the drawing pile whenever more cards are needed. There is no limit on how many times this can be done. The rules might look confusing, but the best way to learn Flux is to play Flux so get playing!"
]